
from sqlalchemy import insert
from app.models import models
from app.database.async_db import async_session_maker






messages = ["👋 Вітаю! Я тут, щоб розповісти про можливості нашого додатку.\n\n",
    "Цей чат – приватний, тому твоє спілкування відбувається в режимі 1-to-1.\n\n", 
    "🕵️‍♂️ Всі повідомлення шифруються і надсилаються через безпечний канал зв'язку. Ти можеш надсилати повідомлення, посилання, ставити лайки (подвійний тап) та відповідати на вибране повідомлення (свайп). 👍\n\n",
    "Такі опції доступні в кожному чаті, форумі чи кімнаті.\n\n"
    "Ми створили різноманітні публічні кімнати, де ти можеш долучатися до обговорення будь-яких тем. Знайди своє улюблене місце та приєднуйся до спільноти! 🗣️🌍,\n\n"
    "Ще більше! Ти можеш створити власну кімнату, вибрати для неї назву та обкладинку. 🖼️ Також ти можеш додати вибрану кімнату до свого списку улюблених місць. 📝,\n\n"
    "Під час створення кімнати ти можеш обрати її приватність. Створивши приватну кімнату, ти, як власник, зможеш додавати до неї користувачів або видаляти їх. Така кімната буде вашим маленьким таємним куточком! 🤫🔐\n\n",
    "Зверни увагу, оскільки додаток ще в розробці, можливі деякі технічні проблеми (вибачте за незручності). 🛠️\n\n",
    "Ми завжди раді чути твої пропозиції та побажання! 💬\n\n",
    "З любов'ю, команда розробників. 💖"]


async def say_hello_system(recipient_id: int):
    """
    Say hello to a user.

    Args:
        recipient_id (int): The ID of the recipient."""
        
    async with async_session_maker() as session:
        for message in messages:
            stmt = insert(models.PrivateMessage).values(messages=message, sender_id=2, recipient_id=recipient_id)
            result = await session.execute(stmt)
            await session.commit()
            
            message_id = result.inserted_primary_key[0]
        return message_id
